In [3]:
import pandas as pd
students_data = pd.DataFrame()

In [6]:
students_data["Name"] = ["Nomi", "Ali", "Charlie", "David"]
students_data["Age"] = [20, 21, 22, 23]
students_data["Grade"] = ["A", "B", "C", "D"]
students_data["City"] = ["New York", "Los Angeles", "Chicago", "Houston"]
students_data["GPA"] = [3.5, 3.0, 2.5, 2.0]
students_data["student"] = [False, True, False, True]

In [7]:
students_data

      Name  Age Grade         City  GPA  student
0     Nomi   20     A     New York  3.5    False
1      Ali   21     B  Los Angeles  3.0     True
2  Charlie   22     C      Chicago  2.5    False
3    David   23     D      Houston  2.0     True

In [9]:
new_students_data = pd.Series(["laiba", 20, "A", "Krachi", 3.8, True], index=students_data.columns)

In [19]:
students_data =pd.concat([students_data, new_students_data.to_frame().T], ignore_index=True)

In [20]:
students_data

      Name Age Grade         City  GPA student
0     Nomi  20     A     New York  3.5   False
1      Ali  21     B  Los Angeles  3.0    True
2  Charlie  22     C      Chicago  2.5   False
3    David  23     D      Houston  2.0    True
4    laiba  20     A       Krachi  3.8    True

In [21]:
print(students_data.shape)

(5, 6)

In [27]:
print(students_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      object
 2   Grade    5 non-null      object
 3   City     5 non-null      object
 4   GPA      5 non-null      object
 5   student  5 non-null      object
dtypes: object(6)
memory usage: 372.0+ bytes
None

In [34]:
print(students_data["Age"].describe())

count      5
unique     4
top       20
freq       2
Name: Age, dtype: int64

In [35]:
print(students_data["Age"].mean())

21.2

In [36]:
print(students_data["Age"].mode())

0    20
Name: Age, dtype: object

In [37]:
print(students_data["Age"].std())

1.3038404810405297

In [38]:
print(students_data["Age"].min())

20

In [39]:
print(students_data["Age"].max())

23

In [40]:
print(students_data["Age"].count())

5

In [41]:
students_data = students_data.drop(columns=["student"])

In [42]:
students_data

      Name Age Grade         City  GPA
0     Nomi  20     A     New York  3.5
1      Ali  21     B  Los Angeles  3.0
2  Charlie  22     C      Chicago  2.5
3    David  23     D      Houston  2.0
4    laiba  20     A       Krachi  3.8

In [43]:
students_data = students_data.drop(4, axis=0)

In [44]:
students_data

      Name Age Grade         City  GPA
0     Nomi  20     A     New York  3.5
1      Ali  21     B  Los Angeles  3.0
2  Charlie  22     C      Chicago  2.5
3    David  23     D      Houston  2.0

In [45]:
students_data.dropna()

      Name Age Grade         City  GPA
0     Nomi  20     A     New York  3.5
1      Ali  21     B  Los Angeles  3.0
2  Charlie  22     C      Chicago  2.5
3    David  23     D      Houston  2.0

In [47]:
students_data.fillna(12)

C:\Users\Noman's PC\AppData\Local\Temp\ipykernel_8308\1907071124.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  students_data.fillna(12)

      Name  Age Grade         City  GPA
0     Nomi   20     A     New York  3.5
1      Ali   21     B  Los Angeles  3.0
2  Charlie   22     C      Chicago  2.5
3    David   23     D      Houston  2.0

In [56]:
students_data["Age"].quantile(1)

23.0

In [58]:
import pandas as pd
students_data1 = pd.DataFrame()

In [59]:
students_data1["Name"] = ["Nomi", "Ali", "Charlie", "David"]
students_data1["Age"] = [20, 21, 22, 23]

In [63]:
students_data1

      Name  Age
0     Nomi   20
1      Ali   21
2  Charlie   22
3    David   23